Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchedShapeNotAvailable
Skeched shape is not available for this type of element.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchForToposolid
Toposolid sketch is invalid.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BoundaryNoOverlap
The split sketch is out of the boundary of split element sketch..